ori $1, $0, 3	# 3与0号寄存器内容相或，结果存1号寄存器
bgezal $1, jmpYes	# 如果1号寄存器内容大于等于0，则跳转jmpYes处
j end1		# 无条件跳转end1
jmpYes:ori $9, $0, 6  #【第一次对，$9 = 6】 0号寄存器与6相或，结果存9号寄存器
ori $2, $1, 5	# 1号寄存器内容与5相或，结果存2号寄存器
subu $1, $0, $2 # 0号寄存器内容 无符号减 2号寄存器内容，结果存1号寄存器
bgezal $1, jmpYess	# 如果1号寄存器内容大于等于0，则跳转jmpYess处
j end2		# 无条件跳转end2
jmpYess:ori $10, $0, 6 #【第二次对， $10=6】 0号寄存器与6相或，结果存10号寄存器
j end2		# 无条件跳转end2
end1:ori $11, $0, 9  #【第一次不对跳， $11=9】0号寄存器与9相或，结果存11号寄存器
j endd		# 无条件跳转endd
end2:ori $12, $0, 9  #【第二次不对跳， $12 = 9】0号寄存器与9相或，结果存12号寄存器
endd:
